B2BGITVersion/BookingAPIFiles/RemoveOneDayfromtheStayDates.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.juniper.es/webservice/2007/">
  <soapenv:Header/>
  <soapenv:Body>
    <HotelModify>
      <HotelModifyRQ Version="1.1" Language="en">
        <Login Email="user@mydomain.com" Password="pass"/>
        <ReservationLocator ItemId="123456">XXXXXX</ReservationLocator>
        <SearchSementHotels Start="2015-12-19" End="2015-12-20" />
      </HotelModifyRQ>
    </HotelModify>
  </soapenv:Body>
</soapenv:Envelope>